Revit 2026 API

# WorksharingDisplaySettingsSetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings) Method

---

Sets the graphic overrides assigned to elements with a particular ownership status.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings overrides
)
```
```vb
Public Sub SetGraphicOverrides (
	status As CheckoutStatus,
	overrides As WorksharingDisplayGraphicSettings
)
```
```cpp
public:
void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings^ overrides
)
```
```fsharp
member SetGraphicOverrides :
        status : CheckoutStatus *
        overrides : WorksharingDisplayGraphicSettings -> unit
```

#### Parameters

status CheckoutStatus
     The ownership status of interest.
overrides WorksharingDisplayGraphicSettings
     The desired graphic overrides for this ownership status.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

WorksharingDisplaySettings Class

SetGraphicOverrides Overload

Autodesk.Revit.DB Namespace